Show / Hide Table of Contents
Class GrpcReflectionServiceFactory
Creates a dynamic instance of the interface implemented on server to proxy the calls from grpc client service to grpc server.
Inheritance
System.Object
GrpcReflectionServiceFactory
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcReflectionServiceFactory
Methods
Improve this Doc   View Source
CreateInstance<T>(GrpcReflectionClient)
Declaration
public static T CreateInstance<T>(GrpcReflectionClient client)
    where T : class
Parameters
 Type |  Name |  Description
 GrpcReflectionClient |  client
Returns
 Type |  Description
 T
Type Parameters
 Name |  Description
 T
 Improve this Doc
 View Source